blueskycoco/d3/Demo/msp430f149/main.c
		/* Note that creating the timer test/demo tasks will fill the timer
		command queue.  This is intentional, and forms part of the test the tasks
		perform.  It does mean however that, after this function is called, no
		more timer commands can be sent until after the scheduler has been
		started (at which point the timer daemon will drained the timer command
		queue, freeing up space for more commands to be received). */
	//	vStartTimerDemoTask( mainTIMER_TEST_PERIOD );
		
		/* Create the LCD, button poll and register test tasks, as described at
		the top	of this	file. */
		xTaskCreate( prvLCDTask, ( signed char * ) "LCD", configMINIMAL_STACK_SIZE * 2, mainTASK_PARAMETER_CHECK_VALUE, mainLCD_TASK_PRIORITY, NULL );
		xTaskCreate( prvButtonPollTask, ( signed char * ) "BPoll", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL );
		//xTaskCreate( vRegTest1Task, ( signed char * ) "Reg1", configMINIMAL_STACK_SIZE, NULL, 0, NULL );
		//xTaskCreate( vRegTest2Task, ( signed char * ) "Reg2", configMINIMAL_STACK_SIZE, NULL, 0, NULL );

		/* Create the 'check' timer - the timer that periodically calls the
		check function as described at the top of this file.  Note that, for
		the reasons stated in the comments above the call to 
		vStartTimerDemoTask(), that the check timer is not actually started 
		until after the scheduler has been started. */
	//	xCheckTimer = xTimerCreate( ( const signed char * ) "Check timer", mainCHECK_TIMER_PERIOD, pdTRUE, ( void * ) 0, vCheckTimerCallback ); 

		/* Start the scheduler. */
		vTaskStartScheduler();
		
	}

	/* If all is well then this line will never be reached.  If it is reached
	then it is likely that there was insufficient (FreeRTOS) heap memory space
	to create the idle task.  This may have been trapped by the malloc() failed
	hook function, if one is configured. */	
	for( ;; );
}
/*-----------------------------------------------------------*/

static void prvLCDTask( void *pvParameters )
{
xQueueMessage xReceivedMessage;

/* Buffer into which strings are formatted and placed ready for display on the
LCD.  Note this is a static variable to prevent it being allocated on the task
stack, which is too small to hold such a variable.  The stack size is configured
when the task is created. */
static char cBuffer[ 50 ];
unsigned char ucLine = 1;

	/* Now the scheduler has been started (it must have been for this task to
	be running), start the check timer too.  The call to xTimerStart() will
	block until the command has been accepted. */
	if( xCheckTimer != NULL )
	{
		xTimerStart( xCheckTimer, portMAX_DELAY );
	}

	/* This is the only function that is permitted to access the LCD.
	
	First print out the number of bytes that remain in the FreeRTOS heap.  This
	is done after a short delay to ensure all the demo tasks have created all
	the objects they are going to use.  */
	vTaskDelay( mainTIMER_TEST_PERIOD * 10 );
	sprintf( cBuffer, "%d heap free", ( int ) xPortGetFreeHeapSize() );
	//halLcdPrintLine( cBuffer, ucLine, OVERWRITE_TEXT );
	printf("%s\r\n",cBuffer);
	ucLine++;
	
	sprintf( cBuffer, "MSPGCC %lu", ( unsigned long ) __MSPGCC__ );
	//halLcdPrintLine( cBuffer, ucLine, OVERWRITE_TEXT );
	printf("%s\r\n",cBuffer);
	ucLine++;

#if __MSP430X__ & (__MSP430_CPUX_TARGET_SR20__ | __MSP430_CPUX_TARGET_ISR20__)
	//halLcdPrintLine( "++with 20-bit++", ucLine, OVERWRITE_TEXT );
	printf("++with 20-bit++\r\n");
	ucLine++;

	sprintf( cBuffer, "ma%02d mc%02d md%02d",
#if __MSP430X__ & __MSP430_CPUX_TARGET_A20__
			 20
#else /* -ma20 */
			 16
#endif /* -ma20 */
			 ,
#if __MSP430X__ & __MSP430_CPUX_TARGET_C20__
			 20
#else /* -mc20 */
			 16
#endif /* -mc20 */
			 ,
#if __MSP430X__ & __MSP430_CPUX_TARGET_D20__
			 20
#else /* -md20 */
			 16
#endif /* -md20 */
			 );
//	halLcdPrintLine( cBuffer, ucLine, OVERWRITE_TEXT );
	printf("%s\r\n",cBuffer);
	ucLine++;
#endif /* -msr20 */

	/* Just as a test of the port, and for no functional reason, check the task
	parameter contains its expected value. */
	if( pvParameters != mainTASK_PARAMETER_CHECK_VALUE )
	{
		//		halLcdPrintLine( "Invalid parameter", ucLine, OVERWRITE_TEXT );
		printf("Invalid parameter\r\n");
		ucLine++;		
	}

	for( ;; )
	{
		/* Wait for a message to be received.  Using portMAX_DELAY as the block
		time will result in an indefinite wait provided INCLUDE_vTaskSuspend is
		set to 1 in FreeRTOSConfig.h, therefore there is no need to check the
		function return value and the function will only return when a value
		has been received. */
		xQueueReceive( xLCDQueue, &xReceivedMessage, portMAX_DELAY );

		/* Clear the LCD if no room remains for any more text output. */
		if( ucLine > mainMAX_LCD_LINES )
		{
		//	halLcdClearScreen();
			ucLine = 0;
		}
		
		printf("\r\nprvLCDTask \r\n");
		/* What is this message?  What does it contain? */
		switch( xReceivedMessage.cMessageID )
		{
			case mainMESSAGE_BUTTON_UP		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button up = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_MATL		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button matl = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_HARD		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button hard = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_DIREC		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button direc = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_TIMES		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button times = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_SAVE		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button save = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_DEL		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button del = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_AVE		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button ave = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_LEFT		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button left = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_MENU		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button menu = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_RIGHT		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button right = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_BACKLIGHT		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button backligth = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_ESC		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button esc = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_DOWN		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button down = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
			case mainMESSAGE_BUTTON_ENTER		:	/* The button poll task has just
												informed this task that the up
												button on the joystick input has
												been pressed or released. */
												sprintf( cBuffer, "Button enter = %x", ( int ) xReceivedMessage.ulMessageValue );
												break;
												
