blueskycoco/d3/Demo/msp430f149/main.c
#if 0
			case mainMESSAGE_BUTTON_MATL		:	/* The select button interrupt
												just informed this task that the
												select button has been pressed.
												In this case the pointer to the 
												string to print is sent directly 
												in the ulMessageValue member of 
												the	message.  This just 
												demonstrates a different 
												communication technique. */
												sprintf( cBuffer, "%s", ( char * ) xReceivedMessage.pcMessageValue );
												break;
												#endif
			case mainMESSAGE_STATUS			:	/* The tick interrupt hook
												function has just informed this
												task of the system status.
												Generate a string in accordance
												with the status value. */
												prvGenerateStatusMessage( cBuffer, xReceivedMessage.ulMessageValue );
												break;
												
			default							:	sprintf( cBuffer, "Unknown message" );
												break;
		}
		
		/* Output the message that was placed into the cBuffer array within the
		switch statement above, then move onto the next line ready for the next
		message to arrive on the queue. */
	//	halLcdPrintLine( cBuffer, ucLine,  OVERWRITE_TEXT );
		printf("%s\r\n",cBuffer);
		ucLine++;
	}
}
/*-----------------------------------------------------------*/

static void prvGenerateStatusMessage( char *pcBuffer, unsigned long ulStatusValue )
{
	/* Just a utility function to convert a status value into a meaningful
	string for output onto the LCD. */
	switch( ulStatusValue )
	{
		case pdPASS					:	sprintf( pcBuffer, "Status = PASS" );
									break;
		case mainERROR_DYNAMIC_TASKS	:	sprintf( pcBuffer, "Err: Dynamic tsks" );
									break;
		case mainERROR_COM_TEST		:	sprintf( pcBuffer, "Err: COM test" );
									break;
		case mainERROR_GEN_QUEUE_TEST 	:	sprintf( pcBuffer, "Error: Gen Q test" );
									break;
		case mainERROR_REG_TEST		:	sprintf( pcBuffer, "Error: Reg test" );
									break;
		case mainERROR_TIMER_TEST		:	sprintf( pcBuffer, "Error: Tmr test" );
									break;
		case mainERROR_COUNT_SEM_TEST	:	sprintf( pcBuffer, "Error: Count sem" );
									break;
		default					:	sprintf( pcBuffer, "Unknown status" );
									break;
	}
}
/*-----------------------------------------------------------*/

static void prvButtonPollTask( void *pvParameters )
{
unsigned short ucState;
xQueueMessage xMessage;

	/* This tasks performs the button polling functionality as described at the
	top of this file. */
	for( ;; )
	{
		
		
		/* Check the button state. */
		ucState = halButtonsPressed();
		
		if(ucState!=0xffff)
		{
			/* The state has changed, send a message to the LCD task. */
			xMessage.cMessageID = ucState;
			xMessage.ulMessageValue = ( unsigned long ) ucState;
			//ucLastState = ucState;
			printf("\r\nprvButtonPollTask\r\n%x pressed\r\n",ucState);
			xQueueSend( xLCDQueue, &xMessage, portMAX_DELAY );
		}
		
		/* Block for 10 milliseconds so this task does not utilise all the CPU
		time and debouncing of the button is not necessary. */
		vTaskDelay( 10 / portTICK_RATE_MS );
	}
}
/*-----------------------------------------------------------*/

static void vCheckTimerCallback( xTimerHandle xTimer )
{
static unsigned short usLastRegTest1Counter = 0, usLastRegTest2Counter = 0;

/* Define the status message that is sent to the LCD task.  By default the
status is PASS. */
static xQueueMessage xStatusMessage = { .cMessageID=mainMESSAGE_STATUS, .xMessageValue=pdPASS };

	/* This is the callback function used by the 'check' timer, as described
	at the top of this file. */

	/* The parameter is not used. */
	( void ) xTimer;
	
	/* See if the standard demo tasks are executing as expected, changing
	the message that is sent to the LCD task from PASS to an error code if
	any tasks set reports an error. */
	if( xAreComTestTasksStillRunning() != pdPASS )
	{
		xStatusMessage.ulMessageValue = mainERROR_COM_TEST;
	}

	if( xAreDynamicPriorityTasksStillRunning() != pdPASS )
	{
		xStatusMessage.ulMessageValue = mainERROR_DYNAMIC_TASKS;
	}
	
	if( xAreGenericQueueTasksStillRunning() != pdPASS )
	{
		xStatusMessage.ulMessageValue = mainERROR_GEN_QUEUE_TEST;
	}			
	
	if( xAreCountingSemaphoreTasksStillRunning() != pdPASS )
	{
		xStatusMessage.ulMessageValue = mainERROR_COUNT_SEM_TEST;
	}
	
	if( xAreTimerDemoTasksStillRunning( ( portTickType ) mainCHECK_TIMER_PERIOD ) != pdPASS )
	{
		xStatusMessage.ulMessageValue = mainERROR_TIMER_TEST;
	}

	/* Check the reg test tasks are still cycling.  They will stop
	incrementing their loop counters if they encounter an error. */
	if( usRegTest1Counter == usLastRegTest1Counter )
	{
		xStatusMessage.ulMessageValue = mainERROR_REG_TEST;
	}

	if( usRegTest2Counter == usLastRegTest2Counter )
	{
		xStatusMessage.ulMessageValue = mainERROR_REG_TEST;
	}

	usLastRegTest1Counter = usRegTest1Counter;
	usLastRegTest2Counter = usRegTest2Counter;
	
	/* This is called from a timer callback so must not block! */
	xQueueSendToBack( xLCDQueue, &xStatusMessage, mainDONT_BLOCK );
}
/*-----------------------------------------------------------*/

static void prvSetupHardware( void )
{
#if 1
	taskDISABLE_INTERRUPTS();
	
	/* Disable the watchdog. */
	WDTCTL = WDTPW + WDTHOLD+WDTNMI;
  
	halBoardInit();

//	LFXT_Start( XT1DRIVE_0 );
	hal430SetSystemClock( configCPU_CLOCK_HZ, configLFXT_CLOCK_HZ );

	halButtonsInit();
	//halButtonsInterruptEnable( BUTTON_SELECT );

	/* Initialise the LCD, but note that the backlight is not used as the
	library function uses timer A0 to modulate the backlight, and this file
	defines	vApplicationSetupTimerInterrupt() to also use timer A0 to generate
	the tick interrupt.  If the backlight is required, then change either the
	halLCD library or vApplicationSetupTimerInterrupt() to use a different
	timer.  Timer A1 is used for the run time stats time base6. */
	//halLcdInit();
	//halLcdSetContrast( 100 );
	//halLcdClearScreen();
	
	xSerialPortInitMinimal(115200, comBUFFER_LEN );
	
	printf("www.FreeRTOS.org\r\n");
	//halLcdPrintLine( " www.FreeRTOS.org", 0,  OVERWRITE_TEXT );
	#else
	volatile unsigned int i;  
	WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT  
	P3SEL |= 0x30;                            // P3.4,5 = USART0 TXD/RXD  
	BCSCTL1 &= ~XT2OFF;                       // XT2on  
	do  {  
		IFG1 &= ~OFIFG;                           // Clear OSCFault flag  
		for (i = 0xFF; i > 0; i--);               // Time for flag to set  
	 }  while ((IFG1 & OFIFG));                   // OSCFault flag still set?  
	BCSCTL2 |= SELM_2 + SELS;                 // MCLK = SMCLK = XT2 (safe)  
	ME1 |= UTXE0 + URXE0;                     // Enable USART0 TXD/RXD  
	UCTL0 |= CHAR;                            // 8-bit character  
	UTCTL0 |= SSEL1;                          // UCLK = SMCLK  
	UBR00 = 0x34;                             // 8MHz 115200  
	UBR10 = 0x00;                             // 8MHz 115200  
	UMCTL0 = 0x00;                            // 8MHz 115200 modulation  
	UCTL0 &= ~SWRST;                          // Initialize USART state machine  
	IE1 |= URXIE0;                            // Enable USART0 RX interrupt  
	_BIS_SR(LPM0_bits + GIE);                 // Enter LPM0 w/ interrupt
	while(1);
	#endif
}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void )
{
static unsigned long ulCounter = 0;

	/* Is it time to toggle the LED again? */
	ulCounter++;

	/* Just periodically toggle an LED to show that the tick interrupt is
	running.  Note that this access LED_PORT_OUT in a non-atomic way, so tasks
	that access the same port must do so from a critical section. */
	if( ( ulCounter & 0xff ) == 0 )
	{
/*		if( ( LED_PORT_OUT & LED_1 ) == 0 )
		{
			LED_PORT_OUT |= LED_1;
		}
		else
		{
			LED_PORT_OUT &= ~LED_1;
		}
		*/
	}
}
/*-----------------------------------------------------------*/

static void
__attribute__((__interrupt__(PORT2_VECTOR)))
prvSelectButtonInterrupt( void )
{
/* Define the message sent to the LCD task from this interrupt. */
static const xQueueMessage xMessage = { .cMessageID=mainMESSAGE_BUTTON_MATL, .pcMessageValue="Select Interrupt" };
portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

